v2506/run/verification-studies/fcn-krxn/system/FO_columnAverage
columnAverage
{
    // Mandatory entries
    type            columnAverage;
    libs            (fieldFunctionObjects);

    // Note: include processorCyclics!
    patches         ( surface );
    fields
    (
        C_S
        C_CO2
    );

    // Inherited entries
    weight          V;
    enabled         true;
    executeControl  writeTime;
    writeControl    writeTime;
}