v2506/run/verification-studies/fcn-krxn/system/FO_scalarTransport
CO2
{
    type            aniScalarTransport;
    libs            (solverFunctionObjects);
    writeControl    writeTime;
    field           C_CO2;
    nut             D_CO2;
    alphaD          0;
    alphaDt         1;

    fvOptions
    {
        reaction
            {
                type            scalarCodedSource;
                name            CO2_react;
                selectionMode   all;
                fields          (C_CO2);
                active          yes;

                codeOptions
                #{#};

                codeConstrain
                #{#};

                codeCorrect #{#};

                codeInclude
                #{
                    #include "fvCFD.H"
                #};

                codeAddSup
                #{
                    const scalarField& V = mesh_.V();
                    const fvMesh& mesh = eqn.psi().mesh();
                    const volScalarField& k_rxn = mesh.lookupObject<volScalarField>("k_rxn");
                    const volScalarField& C_S  = mesh.lookupObject<volScalarField>("C_S");
                    const volScalarField& C_S_old = C_S.oldTime();

                    scalarField& Sp = eqn.diag();

                    forAll(Sp, cellI)
                    {
                        const scalar coeff = 0.5 * k_rxn[cellI] * C_S_old[cellI];
                        Sp[cellI] -= coeff * V[cellI];
                    }
                #};
            }
    }
}

S
{
    type            aniScalarTransport;
    libs            (solverFunctionObjects);
    writeControl    writeTime;
    field           C_S;
    nut             D_S;
    alphaD          0;
    alphaDt         1;

    fvOptions
    {
        reaction
            {
                type            scalarCodedSource;
                name            S_react;
                selectionMode   all;
                fields          (C_S);
                active          yes;

                codeOptions
                #{#};

                codeConstrain
                #{#};

                codeCorrect #{#};

                codeInclude
                #{
                    #include "fvCFD.H"
                #};

                codeAddSup
                #{
                    const scalarField& V = mesh_.V();
                    const fvMesh& mesh = eqn.psi().mesh();
                    const volScalarField& k_rxn = mesh.lookupObject<volScalarField>("k_rxn");
                    const volScalarField& C_CO2  = mesh.lookupObject<volScalarField>("C_CO2");
                    const volScalarField& C_CO2_old = C_CO2.oldTime();                       

                    scalarField& Sp = eqn.diag();

                    forAll(Sp, cellI)
                    {
                        const scalar coeff = k_rxn[cellI] * C_CO2_old[cellI];
                        Sp[cellI] -= coeff * V[cellI];
                    }
                #};
            }
    }
}