v2506/run/verification-studies/fcn-krxn/system/FO_writeCellCentres
writeCellCentres
{
    type            writeCellCentres;
    libs            (fieldFunctionObjects);
    writeControl    writeTime;
}