v2506/run/verification-studies/fcn-krxn/system/FO_writeCellVolumes
writeCellVolumes
{
    type            writeCellVolumes;
    libs            (fieldFunctionObjects);
    writeControl    writeTime;
}