v2506/run/verification-studies/fcn-krxn/Allrun-serial
##!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

. $WM_PROJECT_DIR/bin/tools/RunFunctions

rm -f log.$(getApplication)

runApplication $(getApplication)

#------------------------------------------------------------------------------